InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеЗапаса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗапаса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПотребности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактеристикиПотребности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДоступности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипЗаписиРаспределенияЗапасов</Name>
					<Comment>Дополнительный разделитель для ускорения записи наборов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗапасыИПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыИПотребности</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаблокированоВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаблокированоПоступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КРазблокировке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладеИзЗаблокированных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступленияИзЗаблокированных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроконтролироватьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодлежитРазблокировке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружаемыйЗаказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейЗапасыИПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузкаИлиПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Comment>Дата поступления / поступления на контроль качества / отгрузки </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыЗаписейЗапасыИПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗаписейЗапасыИПотребности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПервичнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетГрафика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенноеРезервирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетГрафикаРазблокировкиТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗакрытияГрафикаРазблокировкиТовара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РаспределениеЗапасов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();

	// Регистр "Распределение запасов" заполняется данным обработчиком по текущим данным регистра "Запасы и потребности". 
	// Если необходимо обновить распределение запасов в связи с обновлением данных в регистре "Запасы и потребности",
	// необходим отдельный обработчик более низкой очереди.
	
	Обработчик.Процедура = "РегистрыСведений.РаспределениеЗапасов.ОбработатьИзмененияФорматаХранения";
	Обработчик.Версия = "11.5.26.65";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a14ede29-84e0-43a5-8a5a-e86839420447");
	Обработчик.Многопоточный = Истина;
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Критичный;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РаспределениеЗапасов.ЗарегистрироватьДанныеДляИзмененияФорматаХранения";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполняет регистр сведений ""Распределение запасов"" по данным регистра накопления ""Запасы и потребности""
	| в связи с изменением структуры данных регистра сведений ""Распределение запасов"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
	// Особенность РС "Распределение запасов". Он не мигрирует напрямую, а пересчитывается при миграции РН "Запасы и потребности".
	// Текущий обработчик не связан с изменениями РН "Запасы и потребности", поэтому его нужно непосредственно выполнять в подчиненном узле.
	Обработчик.ЗапускатьТолькоВГлавномУзле = Ложь;
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	
	Блокируемые = Новый Массив;
	// Для определения, нужна ли управляемая блокировка, при расчете регистра, после интерактивного проведения документов.
	Блокируемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.РаспределениеЗапасов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.41";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5b78b66c-b22d-499d-94a7-9e485346f7c6");
	Обработчик.Многопоточный = Истина;
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РаспределениеЗапасов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Обновляет в регистре сведений ""Распределение запасов"" данные об остатке и графике поступления товаров и работ
	| содержащихся в оформленных документах ""Акт о расхождениях после приемки"", при раздельном оформлении закупок,
	| ""Корректировка приобретения"", ""Приобретение товаров и услуг"" при раздельном оформлении закупок, либо содержащих работы.
	| Исправляет ошибку движений документов ""Пересчет товаров"" по товарным местам.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.ЗапасыИПотребности.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ЗапасыИПотребности.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.РаспределениеЗапасов.ОбработатьИзмененияФорматаХранения";
	НоваяСтрока.Порядок = "После";
	
	Блокируемые = Новый Массив;
	// Для определения, нужна ли управляемая блокировка, при расчете регистра, после интерактивного проведения документов.
	Блокируемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя()); 
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеДляИзмененияФорматаХранения(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрСведений.РаспределениеЗапасов";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.РаспределениеЗапасов");
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Таблица
		|ГДЕ
		|	Таблица.СостояниеЗапаса = ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ПустаяСсылка)";
	
	РегистрируемыеИзмерения = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеИзмерения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьИзмененияФорматаХранения(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.РаспределениеЗапасов";
	
	Если Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	ТаблицаОбновляемыеДанныеТолькоПоСкладам = ТаблицаОбновляемыеДанные.Скопировать();
	ВсегоСтрок = ТаблицаОбновляемыеДанныеТолькоПоСкладам.Количество();
	Для Счетчик = 1 По ВсегоСтрок Цикл
		Индекс = ВсегоСтрок - Счетчик;
		ЗначениеВСтроке = ТаблицаОбновляемыеДанныеТолькоПоСкладам[Индекс].Склад;
		Если ТипЗнч(ЗначениеВСтроке) <> Тип("СправочникСсылка.Склады") Или Не ЗначениеЗаполнено(ЗначениеВСтроке) Тогда
			ТаблицаОбновляемыеДанныеТолькоПоСкладам.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ПакетнаяОбработкаЗавершиласьНеудачно = Ложь;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Использование = Истина;
	Набор.Отбор.Характеристика.Использование = Истина;
	Набор.Отбор.Склад.Использование = Истина;
	Набор.Отбор.Назначение.Использование = Истина;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных();
		РаспределениеЗапасов.ДобавитьБлокировки(Блокировка, Неопределено,
			ТаблицаОбновляемыеДанные, ТаблицаОбновляемыеДанныеТолькоПоСкладам);
		Блокировка.Заблокировать();
		РезультатРаспределения = РаспределениеЗапасов.ОбновлениеИБПоТовару(ТаблицаОбновляемыеДанные, "РаспределениеЗапасов");
		ВсегоСтрок = РезультатРаспределения.РаспределениеЗапасов.Количество();
		Для Индекс = 0 По ВсегоСтрок - 1 Цикл
			СтрокаТаблицы = РезультатРаспределения.РаспределениеЗапасов[Индекс];
			Если Набор.Отбор.Номенклатура.Значение <> СтрокаТаблицы.Номенклатура
					Или Набор.Отбор.Характеристика.Значение <> СтрокаТаблицы.Характеристика
					Или Набор.Отбор.Склад.Значение <> СтрокаТаблицы.Склад
					Или Набор.Отбор.Назначение.Значение <> СтрокаТаблицы.Назначение Тогда
						
						Если Индекс > 0 Тогда
							ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь);
							Набор.Очистить();
						КонецЕсли;
						
						Набор.Отбор.Номенклатура.Значение = СтрокаТаблицы.Номенклатура;
						Набор.Отбор.Характеристика.Значение = СтрокаТаблицы.Характеристика;
						Набор.Отбор.Склад.Значение = СтрокаТаблицы.Склад;
						Набор.Отбор.Назначение.Значение = СтрокаТаблицы.Назначение;
						
			КонецЕсли;
			Если Не СтрокаТаблицы.Пустая Тогда
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		Если ВсегоСтрок > 0 Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПакетнаяОбработкаЗавершиласьНеудачно = Истина;
	КонецПопытки;
	
	Если ПакетнаяОбработкаЗавершиласьНеудачно Тогда
		Для Каждого Строка Из ТаблицаОбновляемыеДанные Цикл
			
			Набор = Неопределено;
			
			НачатьТранзакцию();
			Попытка
				
				Блокировка = Новый БлокировкаДанных();
				РаспределениеЗапасов.ДобавитьБлокировки(Блокировка, Строка, Неопределено, Неопределено);
				Блокировка.Заблокировать();
				
				ЗначениеВТаблице = ТаблицаОбновляемыеДанные.Скопировать(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Строка));
				РезультатРаспределения = РаспределениеЗапасов.ОбновлениеИБПоТовару(ЗначениеВТаблице, "РаспределениеЗапасов");
				
				Набор = СоздатьНаборЗаписей();
				Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
				Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
				Набор.Отбор.Склад.Установить(Строка.Склад);
				Набор.Отбор.Назначение.Установить(Строка.Назначение);
				Набор.Загрузить(РезультатРаспределения.РаспределениеЗапасов.Скопировать(Новый Структура("Пустая", Ложь)));
				
				// Третий параметр "Ложь", так как текущий обработчик не связан с исправлением данных об остатке,
				// а связан с изменением формата хранения данных.
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь);
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				Если Набор = Неопределено Тогда
					Набор = СоздатьНаборЗаписей();
					Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
					Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
					Набор.Отбор.Склад.Установить(Строка.Склад);
					Набор.Отбор.Назначение.Установить(Строка.Назначение);
				КонецЕсли;
				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Набор);
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрСведений.РаспределениеЗапасов";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.РаспределениеЗапасов");
	
	ИмяРегистраЗапасыИПотребности = "ЗапасыИПотребности";
	ПолноеИмяРегистраЗапасыИПотребности = "РегистрНакопления.ЗапасыИПотребности";
	
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ПолучитьТекстыЗапроса = Истина;
	
	ТекстыЗапроса = Документы.АктОРасхожденияхПослеПриемки.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистраЗапасыИПотребности,
		ДопПараметры);
	
	РегистраторыАктыПослеПриемки = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистраЗапасыИПотребности,
		"Документ.АктОРасхожденияхПослеПриемки",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	ТекстыЗапроса = Документы.КорректировкаПриобретения.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистраЗапасыИПотребности,
		ДопПараметры);
	
	РегистраторыКорректировкиПриобретения = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистраЗапасыИПотребности,
		"Документ.КорректировкаПриобретения",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	ТекстыЗапроса = Документы.ПриобретениеТоваровУслуг.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистраЗапасыИПотребности,
		ДопПараметры);
	
	РегистраторыПриобретения = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистраЗапасыИПотребности,
		"Документ.ПриобретениеТоваровУслуг",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	ТекстыЗапроса = Документы.ПересчетТоваров.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистраЗапасыИПотребности,
		ДопПараметры);
	
	РегистраторыПересчетыТоваров = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистраЗапасыИПотребности,
		"Документ.ПересчетТоваров",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("РегистраторыАктыПослеПриемки", РегистраторыАктыПослеПриемки);
	Запрос.УстановитьПараметр("РегистраторыКорректировкиПриобретения", РегистраторыКорректировкиПриобретения);
	Запрос.УстановитьПараметр("РегистраторыПриобретения", РегистраторыПриобретения);
	Запрос.УстановитьПараметр("РегистраторыПересчетыТоваров", РегистраторыПересчетыТоваров);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Набор.Номенклатура КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад КАК Склад,
		|	Набор.Назначение КАК Назначение
		|ПОМЕСТИТЬ АналитикиДляОбновления
		|ИЗ(
			// Перенос движений по отражению расхождений в корректировку приобретения.
		|	ВЫБРАТЬ
		|		ТоварыДокумента.Номенклатура КАК Номенклатура,
		|		ТоварыДокумента.Характеристика КАК Характеристика,
		|		ТоварыДокумента.Склад КАК Склад,
		|		ТоварыДокумента.Назначение КАК Назначение
		|	ИЗ
		|		Документ.АктОРасхожденияхПослеПриемки КАК ТаблицаДокумента
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТоварыДокумента
		|			ПО ТоварыДокумента.Ссылка = ТаблицаДокумента.Ссылка
		|	ГДЕ
		|		ТаблицаДокумента.Проведен
		|		И ТаблицаДокумента.Ссылка В (&РегистраторыАктыПослеПриемки)
		|		И ТаблицаДокумента.ХозяйственнаяОперация В(
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути))
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
			// Перенос движений по отражению расхождений в корректировку приобретения.
			// Также добавление движений по работам в двухходовке.
			// Удаление движений по наличию работ в одноходовке для варианта отражения Отразить на доходах/ Списать на расходы
		|	ВЫБРАТЬ
		|		ТоварыДокумента.Номенклатура КАК Номенклатура,
		|		ТоварыДокумента.Характеристика КАК Характеристика,
		|		ТоварыДокумента.Склад КАК Склад,
		|		ТоварыДокумента.Назначение КАК Назначение
		|	ИЗ
		|		Документ.КорректировкаПриобретения КАК ТаблицаДокумента
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения.Расхождения КАК ТоварыДокумента
		|			ПО ТоварыДокумента.Ссылка = ТаблицаДокумента.Ссылка
		|	ГДЕ
		|		ТаблицаДокумента.Проведен
		|		И ТаблицаДокумента.Ссылка В (&РегистраторыКорректировкиПриобретения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Движения по работам документов не поддерживающих двухходовку работ (по старым договорам)
		|ВЫБРАТЬ
		|	ТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ТоварыДокумента.Характеристика КАК Характеристика,
		|	ТоварыДокумента.Склад КАК Склад,
		|	ТоварыДокумента.Назначение КАК Назначение
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ТаблицаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ТоварыДокумента
		|		ПО ТоварыДокумента.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И ТаблицаДокумента.Ссылка В (&РегистраторыПриобретения)
		|	И ТоварыДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|	И ТаблицаДокумента.ХозяйственнаяОперация В(
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки))
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// Неверные движения пересчетов товаров по упаковкам товарных мест.
		|	ВЫБРАТЬ
		|		ТоварыДокумента.Номенклатура КАК Номенклатура,
		|		ТоварыДокумента.Характеристика КАК Характеристика,
		|		ТаблицаДокумента.Склад КАК Склад,
		|		ТоварыДокумента.Назначение КАК Назначение
		|	ИЗ
		|		Документ.ПересчетТоваров КАК ТаблицаДокумента
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров.Товары КАК ТоварыДокумента
		|			ПО ТоварыДокумента.Ссылка = ТаблицаДокумента.Ссылка
		|	ГДЕ
		|		ТаблицаДокумента.Проведен
		|		И ТаблицаДокумента.Ссылка В (&РегистраторыПересчетыТоваров)) КАК Набор
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение
		|ИЗ
		|	АналитикиДляОбновления КАК Таблица";
	
	РегистрируемыеИзмерения = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеИзмерения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.РаспределениеЗапасов";
	
	Если Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Если ОбновлениеИнформационнойБазы.ЕстьЗаблокированныеПредыдущимиОчередямиДанные(Параметры.Очередь, ПолноеИмяРегистра) Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, "РегистрНакопления.ЗапасыИПотребности") Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для Каждого Строка Из ТаблицаОбновляемыеДанные Цикл
		
		Набор = Неопределено;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			РаспределениеЗапасов.ДобавитьБлокировки(Блокировка, Строка, Неопределено, Неопределено);
			Блокировка.Заблокировать();
			
			ЗначениеВТаблице = ТаблицаОбновляемыеДанные.Скопировать(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Строка));
			РезультатРаспределения = РаспределениеЗапасов.ОбновлениеИБПоТовару(ЗначениеВТаблице, "РаспределениеЗапасов");
			
			Набор = СоздатьНаборЗаписей();
			Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
			Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
			Набор.Отбор.Склад.Установить(Строка.Склад);
			Набор.Отбор.Назначение.Установить(Строка.Назначение);
			Набор.Загрузить(РезультатРаспределения.РаспределениеЗапасов.Скопировать(Новый Структура("Пустая", Ложь)));
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина);
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Если Набор = Неопределено Тогда
				Набор = СоздатьНаборЗаписей();
				Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
				Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
				Набор.Отбор.Склад.Установить(Строка.Склад);
				Набор.Отбор.Назначение.Установить(Строка.Назначение);
			КонецЕсли;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Набор);
		КонецПопытки;
		
	КонецЦикла;
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
